#include <iostream> // підключення бібліотеки для стандартного введення/виведення
#include <cmath> // підключення математичної бібліотеки
#include <Windows.h> // підключення системної бібліотеки Windows для налаштування таблиці кодування консолі
using namespace std; // використання стандартного простору імен std
int main() { // головна функція програми, з якої починається її виконання
	SetConsoleCP(65001); // налаштування кодової сторінки для зчитування з клавіатури українських літер
	SetConsoleOutputCP(65001); // налаштування кодової сторінки для коректного виводу українських літер у консоль
	int continueProgram; // оголошення змінної-прапорця для керування повторним запуском програми
	do {  // початок циклу із післяумовою для забезпечення багаторазового виконання обчислень
		int Pr; // оголошення цілочислової змінної Pr для збереження обраного пункту меню (1, 2 або 3)
		cout << "Оберіть дію (параметр Pr):\n"; // виведення на консоль тексту-підказки для користувача
		cout << "1 - Обчислити n-й елемент ряду\n"; // пункт 1 (обчислення одного елемента u_n)
		cout << "2 - Обчислити суму перших n елементів ряду\n"; // пункт 2 (обчислення суми перших n елементів)
		cout << "3 - Обчислити суму ряду з точністю Eps = 10^-5\n"; // пункт 3 (обчислення нескінченної суми з точністю)
		cout << "Ваш вибір (1, 2 або 3): "; // виведення прохання вказати вибір
		cin >> Pr; // Зчитування введеного значення у змінну Pr
		switch (Pr) { // багатоваріантне розгалуження, щоб виконати один із кількох блоків коду залежно від введеного значення Pr
		case 1: { // блок коду для варіанта Pr = 1
			int n; // змінна для збереження номера елемента n
			cout << "Введіть номер елемента n (n >= 0): "; // підказка для введення n
			cin >> n; // зчитування номера n з клавіатури
			double un = pow(-1, n) / (2.0 * n + 1.0); // оголошується змінна з ім'ям un дійсного типу (double), яка зберігатиме обчислений n-й елемент ряду (дробове число)
			cout << "Елемент u_" << n << " = " << un << endl; // виводить у консоль готове текстове повідомлення із заповненими значеннями змінних та переводить на новий рядок
			break; // оператор переривання: зупиняє подальше виконання конструкції switch
		}
		case 2: {  // блок коду для варіанта Pr = 2
			int n; // змінна для кількості елементів n
			cout << "Введіть кількість елементів n (n > 0): "; // підказка для введення кількості елементів
			cin >> n; // pчитування кількості n
			double sum = 0.0; // змінна для накопичення суми
			double u = 1.0; // перший елемент ряду
			for (int m = 0; m < n; m++) { // цикл робить n кроків (наприклад, при n=3 виконуються кроки m=0, m=1, m=2)
				sum += u; // додавання поточного елемента до загальної суми 
				u = u * (-(2.0 * m + 1.0) / (2.0 * m + 3.0)); // обчислення наступного елемента за формулою
			}
			cout << "Сума перших " << n << " елементів ряду = " << sum << endl; // виведення отриманої суми перших n елементів
			break; // вихід з оператора switch після виконання блоку case 2
		}
		case 3: { // блок коду для варіанта Pr = 3
			double eps = 1e-5; // задання точності
			double sum = 0.0; // накопичувальна змінна для суми ряду
			double u = 1.0; // початкове значення першого елемента ряду
			int m = 0; // початкове значення індексу
			while (fabs(u) >= eps) { // цикл працює, поки модуль u не менший за eps
				sum += u; // ДОДАВАННЯ ПОТОЧНОГО ЕЛЕМЕНТА ДО СУМИ
				u = u * (-(2.0 * m + 1.0) / (2.0 * m + 3.0)); // наступний елемент
				m++; // збільшення лічильника
			}
			double control = atan(1.0); // контрольне значення Pi / 4
			cout << "Обчислена сума ряду = " << sum << endl;
			cout << "Кількість врахованих членів ряду = " << m << endl;
			cout << "Контрольне значення (Pi / 4) = " << control << endl;
			cout << "Абсолютна похибка = " << fabs(sum - control) << endl;
			break; // вихід з блоку case 3
		}
		default: {
			cout << "Некоректний вибір! Введіть значення 1, 2 або 3." << endl;
			break;
		}
		}  // закриває switch
		system("pause");
		cout << "\n Бажаєте продовжити? (1 - так, 0 - ні): ";
		cin >> continueProgram;

	} while (continueProgram != 0); // закриває do-while

	return 0;
} // закриває main












